test/artillery/virtualM-docker/stock-update.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3000/
  http:
    timeout: 10
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 40
      # arrivalRate: 20
      # rampTo: 100
      name: "Case: 1 virtual users to 10 in 15 seconds"
scenarios:
  - flow:
    - loop:
      - log: "Update stock"
      - put: 
          url: "/warehouse/stock/1"
          json: {
            id: 1,
            quantity: 2,
            location_id: 1,
            product_id: 1,
            unit_id: 1,
            version: 0
          }
      count: 2
# artillery run ./test/artillery/stock-update.yml